# Pandas Tutorial

10 minutes to pandas:
https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html

In [1]:
import numpy as np
import pandas as pd

To create a DataFrance, pass a NumPy array, here using a datetime index with labeled columns:

In [2]:
#Create date range with lower bound as fist arg & period num to generate 
dates = pd.date_range("20130101", periods=6)

In [4]:
# view dates
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
# randn gives vals in 6x$ array
# index of the array is dates
# column headers list ABCD
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [8]:
df

                   A         B         C         D
2013-01-01 -1.519393  0.112481 -0.349790  1.337715
2013-01-02 -0.282524  0.714655  0.683200  0.387617
2013-01-03 -1.299228 -1.463746  1.567786  0.240132
2013-01-04 -0.267967  1.118605  0.898064 -0.499973
2013-01-05  1.283482 -1.937413 -0.087112 -0.416447
2013-01-06  1.216430 -0.513104 -1.042482  0.469888

Creating a dataframe from dict of objects:

In [9]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [11]:
# Columns all have different data types
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
#view top rows
df.head()

                   A         B         C         D
2013-01-01 -1.519393  0.112481 -0.349790  1.337715
2013-01-02 -0.282524  0.714655  0.683200  0.387617
2013-01-03 -1.299228 -1.463746  1.567786  0.240132
2013-01-04 -0.267967  1.118605  0.898064 -0.499973
2013-01-05  1.283482 -1.937413 -0.087112 -0.416447

In [13]:
#view bottom rows
df.tail()

                   A         B         C         D
2013-01-02 -0.282524  0.714655  0.683200  0.387617
2013-01-03 -1.299228 -1.463746  1.567786  0.240132
2013-01-04 -0.267967  1.118605  0.898064 -0.499973
2013-01-05  1.283482 -1.937413 -0.087112 -0.416447
2013-01-06  1.216430 -0.513104 -1.042482  0.469888

In [14]:
#view descirption of data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.144866 -0.328087  0.278278  0.253155
std    1.195766  1.207329  0.946923  0.671872
min   -1.519393 -1.937413 -1.042482 -0.499973
25%   -1.045052 -1.226085 -0.284120 -0.252302
50%   -0.275245 -0.200311  0.298044  0.313875
75%    0.845331  0.564111  0.844348  0.449320
max    1.283482  1.118605  1.567786  1.337715

In [17]:
# view index & columns of df
print(df.index)
df.columns

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
# representation of the underlying data in Numpy
# Note: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column.
# pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame
# can be expensive
df.to_numpy()

array([[-1.5193929 ,  0.11248104, -0.34979013,  1.33771474],
       [-0.28252382,  0.71465458,  0.68320039,  0.3876173 ],
       [-1.29922765, -1.4637458 ,  1.56778564,  0.24013186],
       [-0.26796709,  1.11860521,  0.89806403, -0.49997337],
       [ 1.2834824 , -1.93741304, -0.08711159, -0.41644706],
       [ 1.21643033, -0.51310397, -1.04248239,  0.46988818]])

In [19]:
# Transposing Data - Index will be on top
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.519393   -0.282524   -1.299228   -0.267967    1.283482    1.216430
B    0.112481    0.714655   -1.463746    1.118605   -1.937413   -0.513104
C   -0.349790    0.683200    1.567786    0.898064   -0.087112   -1.042482
D    1.337715    0.387617    0.240132   -0.499973   -0.416447    0.469888

In [22]:
# Sorting by Axis (rows (0) or cols (1))
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  1.216430 -0.513104 -1.042482  0.469888
2013-01-05  1.283482 -1.937413 -0.087112 -0.416447
2013-01-04 -0.267967  1.118605  0.898064 -0.499973
2013-01-03 -1.299228 -1.463746  1.567786  0.240132
2013-01-02 -0.282524  0.714655  0.683200  0.387617
2013-01-01 -1.519393  0.112481 -0.349790  1.337715

In [24]:
# Sorting by values 
df.sort_values(by="A")

                   A         B         C         D
2013-01-01 -1.519393  0.112481 -0.349790  1.337715
2013-01-03 -1.299228 -1.463746  1.567786  0.240132
2013-01-02 -0.282524  0.714655  0.683200  0.387617
2013-01-04 -0.267967  1.118605  0.898064 -0.499973
2013-01-06  1.216430 -0.513104 -1.042482  0.469888
2013-01-05  1.283482 -1.937413 -0.087112 -0.416447

## Selection of Data

In [25]:
#Selecting a single column
df["A"]

2013-01-01   -1.519393
2013-01-02   -0.282524
2013-01-03   -1.299228
2013-01-04   -0.267967
2013-01-05    1.283482
2013-01-06    1.216430
Freq: D, Name: A, dtype: float64

In [26]:
# Can slice rows
df[:2]

                   A         B        C         D
2013-01-01 -1.519393  0.112481 -0.34979  1.337715
2013-01-02 -0.282524  0.714655  0.68320  0.387617

In [27]:
# Can slice by index
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.282524  0.714655  0.683200  0.387617
2013-01-03 -1.299228 -1.463746  1.567786  0.240132
2013-01-04 -0.267967  1.118605  0.898064 -0.499973

#### Selecting by label

In [30]:
# Use df.loc for label, below first row
df.loc[dates[0]]

A   -1.519393
B    0.112481
C   -0.349790
D    1.337715
Name: 2013-01-01 00:00:00, dtype: float64

In [36]:
# Selecting multi-axis by label
df.loc[:, ["A","B"]]

                   A         B
2013-01-01 -1.519393  0.112481
2013-01-02 -0.282524  0.714655
2013-01-03 -1.299228 -1.463746
2013-01-04 -0.267967  1.118605
2013-01-05  1.283482 -1.937413
2013-01-06  1.216430 -0.513104

In [37]:
# Can slice by index label, both endpoints included
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.282524  0.714655
2013-01-03 -1.299228 -1.463746
2013-01-04 -0.267967  1.118605

#### Selection by Position

In [39]:
# iloc is used
df.iloc[3]

A   -0.267967
B    1.118605
C    0.898064
D   -0.499973
Name: 2013-01-04 00:00:00, dtype: float64

In [43]:
# can slice by integer, 3rd & 4th rows, cols 0 & 1
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.267967  1.118605
2013-01-05  1.283482 -1.937413

In [44]:
# by list of int positions, rows 1,2 & 4, cols 0 & 1
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.282524  0.683200
2013-01-03 -1.299228  1.567786
2013-01-05  1.283482 -0.087112

In [46]:
#can slice  rows or cols explicitly, below cols
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.112481 -0.349790
2013-01-02  0.714655  0.683200
2013-01-03 -1.463746  1.567786
2013-01-04  1.118605  0.898064
2013-01-05 -1.937413 -0.087112
2013-01-06 -0.513104 -1.042482

#### Boolean indexing

In [47]:
# Using a single columnâ€™s values to select data
df[df["A"] > 0]

                   A         B         C         D
2013-01-05  1.283482 -1.937413 -0.087112 -0.416447
2013-01-06  1.216430 -0.513104 -1.042482  0.469888

In [49]:
# Selecting values from a DataFrame where a boolean condition is met
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.112481       NaN  1.337715
2013-01-02       NaN  0.714655  0.683200  0.387617
2013-01-03       NaN       NaN  1.567786  0.240132
2013-01-04       NaN  1.118605  0.898064       NaN
2013-01-05  1.283482       NaN       NaN       NaN
2013-01-06  1.216430       NaN       NaN  0.469888